["","About","Pafera","Learn","Useful Store","<p>\nDo you believe that learning should be fun and enjoyable?\n<\/p>\n<p>\nDo you think opening a textbook and reading is not exactly the best way of learning?\n<\/p>\n<p>\nDo you want an easy way to keep track of everything that you have ever learned and how well you remember them?\n<\/p>\n<p>\nDo you enjoy being at the forefront of technology and progress?\n<\/p>\n<p>\nIf you do, then you will probably enjoy what we do.\n<\/p>\n<p>\nWe're a family company specializing in creating educational software for students of all ages, teaching elementary to high school students, and helping small and medium businesses around us to handle the myriad problems which doing business brings. We've been handling web technologies since 1995, and are very fond of using HTML5 and Android to bring modern technologies to the masses.\n<\/p>\n<p>\nIf you have a problem with your studies or with your computing devices, just call us up, send us a text message, or write us an email. It's very likely that we've already handled a similar problem before, and we'll be ready to help whenever you need us.\n<\/p>\n<h2>Privacy<\/h2>\n<p>\nWe hate ads and people who sell your personal information to advertisers, so you'll see none of those on this website. We use SSL encryption, Blowfish password hashing with random salts, a security enhanced database system, and other such methods to protect your information. We make our money on website subscription fees, teaching students, and technological consulting with the businesses around us, so we will not betray your trust. Whatever you do here will stay here and only here.\n<\/p>\n","Homepage","You Have Been Logged Out","No one else will be able to use your account on this computer.","Login Again","Michael's Memories","Wifey's Handmade Store","An American's Guide to Sanya","Folder name (Descending)","Size (Ascending)","Size (Descending)","Time (Ascending)","Time (Descending)","Filename contains","Conclusion","Activities","Homepage","<p class=Center>\nPafera Technologies Inc.<br>\n149 Yuya Road, Sanya, Hainan, China<br>\n1-380-752-6047<br>\n<a href=\"mailto:me@pafera.com\">me@pafera.com<\/a>\n<\/p>","Class Tools","Write Answers","Send Answer","Clear","Search","If you're seeing this message, you probably have Noscript enabled. This site uses JQuery Mobile, which means that it probably won't work very well without JavaScript. We have no ads, tracking cookies, or anything else that I personally find annoying, so if you could enable JavaScript for this site, it would likely enhance your experience.","<p><img src=\"\/apps\/main\/images\/icons\/info.png\" class=\"FloatLeft\">Looks like you're using an older browser, which means that some things may not work quite right.<\/p>\n<p>We suggesting upgrading to Firefox or Chrome if you want to have a good experience on not only this site, but many other sites across the web.<\/p>\n<a class=\"Button Color3 Width93\" onclick=\"window.open('http:\/\/www.google.com\/chrome\/', '_blank')\">Download Chrome<\/a>\n<a class=\"Button Color2 Width93\" onclick=\"window.open('http:\/\/www.mozilla.org\/', '_blank')\">Download Firefox<\/a>\n<a class=\"Button Color1 Width93\" onclick=\"P.CloseThisPopup(this)\">No, thanks!<\/a>","Multiple Choice","Click here if your browser doesn't automatically redirect you."]